Revit 2026 API

# RebarInSystemIsRebarInSection Method

---

Identifies if this RebarInSystem is cut by the view plane of the given view.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsRebarInSection(
	View dBView
)
```
```vb
Public Function IsRebarInSection (
	dBView As View
) As Boolean
```
```cpp
public:
bool IsRebarInSection(
	View^ dBView
)
```
```fsharp
member IsRebarInSection :
        dBView : View -> bool
```

#### Parameters

dBView View
     The view.

#### Return Value

Boolean True if this RebarInSystem is cut by the view plane, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method applies only for elevations and sections. For any other view types will return false.

#### Reference

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace